hello = ('<b>Привет 👋 Это бот Стоковые фото</b>\n\n'
        '<b>Мы создаем базу фотографий для общего доступа, а взамен вознаграждаем пользователей за фотографии</b>\n\n'
        '👉Если хочешь обменять фото на деnужное вознаграждение, жми "<b>ПРОДОЛЖИТЬ</b>"')

start_answer = '<b>Супер! Теперь отправь фотографию для оценки:</b>'

good = '<b>Отлично!✅</b>'

loading = '<b>Загрузка...</b>'

analysis = '<b>Анализируем фото...</b>'

setsize = '<b>Устанавливаем размер...</b>'

success = '<b>Успешно!✅ \nВыбери валютy зачисления:</b>'

money_success = '<b>Успешно!✅ Стоиmость Вашей фотографии: {}. \n\nДля вывода нажми кнопку "ПОЛУЧИТЬ"</b>'

channels = ('Отлично!\n\n'
'⛔️Для того, чтобы использовать нашего бота, тебе <b>необходимо подписаться на каналы спонсоры, благодаря которым наш бот работает бесплатно</b>\n\n{}')
# '{%for i, val in enumerate(channels, start=1)%}'
# '{{i}) <a href="{val[1]}">{val[0]}</a>}'
# '{% endfor %}')

final_success = ('<b>Успешно!</b>✅\n\n'
                '<b>Мы вышлем тебе вознаграждение в течение 5 дней рабочих дней,'
                'все зависит от уровня нагрузки бankов.</b>\n\n👉<b>С тобой свяжется менеджер '
                'для уточнения твоих реквизитов.</b>\n\n<b>Во время ожидания нельзя отписываться</b> от каналов '
                'спонсоров, иначе бот остановит свою работу. \n\n<b>Ты также можешь отправлять по'
                'несколько фотографий повторно, так как каждое фото будет вознаграждено!</b>\n\n'
                '<i>С уважением, команда проекта "Стоковые фото"!</i>')

subscribe = '‼️Подпишитесь на все каналы'

hello_admin = 'Привет! Администратор!!!!'

mailing_text = """Отлично! Ваш текст рассылки:\n\n"""

mailing_choice = 'Выбери действие.'

mailing_confirm = 'Отправка рассылки.'